<details ><summary>Digger run report at 2025-10-02 19:39:33 (UTC)</summary>
    <details open="true"><summary>Plan output</summary>

```terraform
Terraform will perform the following actions:

  # aws_dynamodb_table.main will be created
  + resource "aws_dynamodb_table" "main" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "id"
      + id               = (known after apply)
      + name             = "white-oak-prod-dynamodb-table"
      + read_capacity    = 5
      + region           = "us-east-1"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "production"
          + "ManagedBy"   = "terragrunt"
          + "Name"        = "white-oak-prod-dynamodb-table"
          + "Project"     = "white-oak"
          + "Purpose"     = "testing-implicit-stack"
        }
      + tags_all         = {
          + "Environment" = "production"
          + "ManagedBy"   = "terragrunt"
          + "Name"        = "white-oak-prod-dynamodb-table"
          + "Project"     = "white-oak"
          + "Purpose"     = "testing-implicit-stack"
        }
      + write_capacity   = 5

      + attribute {
          + name = "created_at"
          + type = "S"
        }
      + attribute {
          + name = "id"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "id"
          + name               = "CreatedAtIndex"
          + non_key_attributes = [
              + "data",
            ]
          + projection_type    = "INCLUDE"
          + range_key          = "created_at"
          + read_capacity      = 5
          + write_capacity     = 5
        }

      + point_in_time_recovery {
          + enabled                 = true
          + recovery_period_in_days = (known after apply)
        }

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + table_arn          = (known after apply)
  + table_id           = (known after apply)
  + table_name         = "white-oak-prod-dynamodb-table"
  + table_stream_arn   = (known after apply)
  + table_stream_label = (known after apply)

```
</details>

<details ><summary>Terraform plan validation check (environments_prod_us-east-1_dynamodb)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>

</details>